---
kind: type
id: T:Autodesk.Revit.DB.FilterDoubleRule
source: html/221576be-5e81-8802-5487-671f58c6cd8c.htm
---
# Autodesk.Revit.DB.FilterDoubleRule

A filter rule that operates on double-precision numeric values in a Revit project.

## Syntax (C#)
```csharp
public class FilterDoubleRule : FilterNumericValueRule
```